// Cached, ready-to-use bindings file if libclang isn't found

/* automatically generated by rust-bindgen 0.72.1 */

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GoString_ {
    pub p: *const ::std::os::raw::c_char,
    pub n: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GoString_"][::std::mem::size_of::<_GoString_>() - 16usize];
    ["Alignment of _GoString_"][::std::mem::align_of::<_GoString_>() - 8usize];
    ["Offset of field: _GoString_::p"][::std::mem::offset_of!(_GoString_, p) - 0usize];
    ["Offset of field: _GoString_::n"][::std::mem::offset_of!(_GoString_, n) - 8usize];
};
unsafe extern "C" {
    pub fn _GoStringLen(s: _GoString_) -> usize;
}
unsafe extern "C" {
    pub fn _GoStringPtr(s: _GoString_) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn WmNewContactsNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_Name: *mut ::std::os::raw::c_char,
        p_Phone: *mut ::std::os::raw::c_char,
        p_IsSelf: ::std::os::raw::c_int,
        p_IsAlias: ::std::os::raw::c_int,
        p_Notify: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewChatsNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_IsUnread: ::std::os::raw::c_int,
        p_IsMuted: ::std::os::raw::c_int,
        p_IsPinned: ::std::os::raw::c_int,
        p_LastMessageTime: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewMessagesNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_MsgId: *mut ::std::os::raw::c_char,
        p_SenderId: *mut ::std::os::raw::c_char,
        p_Text: *mut ::std::os::raw::c_char,
        p_FromMe: ::std::os::raw::c_int,
        p_QuotedId: *mut ::std::os::raw::c_char,
        p_FileId: *mut ::std::os::raw::c_char,
        p_FilePath: *mut ::std::os::raw::c_char,
        p_FileStatus: ::std::os::raw::c_int,
        p_TimeSent: ::std::os::raw::c_int,
        p_IsRead: ::std::os::raw::c_int,
        p_IsEdited: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewStatusNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_UserId: *mut ::std::os::raw::c_char,
        p_IsOnline: ::std::os::raw::c_int,
        p_TimeSeen: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewTypingNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_UserId: *mut ::std::os::raw::c_char,
        p_IsTyping: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewMessageStatusNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_MsgId: *mut ::std::os::raw::c_char,
        p_IsRead: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewMessageFileNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_MsgId: *mut ::std::os::raw::c_char,
        p_FilePath: *mut ::std::os::raw::c_char,
        p_FileStatus: ::std::os::raw::c_int,
        p_Action: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmNewMessageReactionNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_MsgId: *mut ::std::os::raw::c_char,
        p_SenderId: *mut ::std::os::raw::c_char,
        p_Text: *mut ::std::os::raw::c_char,
        p_FromMe: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmDeleteChatNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmDeleteMessageNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_MsgId: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmUpdateMuteNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_IsMuted: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmUpdatePinNotify(
        p_ConnId: ::std::os::raw::c_int,
        p_ChatId: *mut ::std::os::raw::c_char,
        p_IsPinned: ::std::os::raw::c_int,
        p_TimePinned: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmReinit(p_ConnId: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn WmSetProtocolUiControl(
        p_ConnId: ::std::os::raw::c_int,
        p_IsTakeControl: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn WmSetStatus(p_ConnId: ::std::os::raw::c_int, p_Flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn WmClearStatus(p_ConnId: ::std::os::raw::c_int, p_Flags: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn WmAppConfigGetNum(p_Param: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn WmAppConfigSetNum(p_Param: *mut ::std::os::raw::c_char, p_Value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn WmLogTrace(
        p_Filename: *mut ::std::os::raw::c_char,
        p_LineNo: ::std::os::raw::c_int,
        p_Message: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmLogDebug(
        p_Filename: *mut ::std::os::raw::c_char,
        p_LineNo: ::std::os::raw::c_int,
        p_Message: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmLogInfo(
        p_Filename: *mut ::std::os::raw::c_char,
        p_LineNo: ::std::os::raw::c_int,
        p_Message: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmLogWarning(
        p_Filename: *mut ::std::os::raw::c_char,
        p_LineNo: ::std::os::raw::c_int,
        p_Message: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmLogError(
        p_Filename: *mut ::std::os::raw::c_char,
        p_LineNo: ::std::os::raw::c_int,
        p_Message: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn WmExtQrCode(p_path: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn WmExtLoginPairingCode(p_code: *mut ::std::os::raw::c_char);
}
pub type GoInt8 = ::std::os::raw::c_schar;
pub type GoUint8 = ::std::os::raw::c_uchar;
pub type GoInt16 = ::std::os::raw::c_short;
pub type GoUint16 = ::std::os::raw::c_ushort;
pub type GoInt32 = ::std::os::raw::c_int;
pub type GoUint32 = ::std::os::raw::c_uint;
pub type GoInt64 = ::std::os::raw::c_longlong;
pub type GoUint64 = ::std::os::raw::c_ulonglong;
pub type GoInt = GoInt64;
pub type GoUint = GoUint64;
pub type GoUintptr = usize;
pub type GoFloat32 = f32;
pub type GoFloat64 = f64;
pub type GoComplex64 = __BindgenComplex<f32>;
pub type GoComplex128 = __BindgenComplex<f64>;
pub type _check_for_64_bit_pointer_matching_GoInt = [::std::os::raw::c_char; 1usize];
pub type GoString = _GoString_;
pub type GoMap = *mut ::std::os::raw::c_void;
pub type GoChan = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GoInterface {
    pub t: *mut ::std::os::raw::c_void,
    pub v: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoInterface"][::std::mem::size_of::<GoInterface>() - 16usize];
    ["Alignment of GoInterface"][::std::mem::align_of::<GoInterface>() - 8usize];
    ["Offset of field: GoInterface::t"][::std::mem::offset_of!(GoInterface, t) - 0usize];
    ["Offset of field: GoInterface::v"][::std::mem::offset_of!(GoInterface, v) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GoSlice {
    pub data: *mut ::std::os::raw::c_void,
    pub len: GoInt,
    pub cap: GoInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoSlice"][::std::mem::size_of::<GoSlice>() - 24usize];
    ["Alignment of GoSlice"][::std::mem::align_of::<GoSlice>() - 8usize];
    ["Offset of field: GoSlice::data"][::std::mem::offset_of!(GoSlice, data) - 0usize];
    ["Offset of field: GoSlice::len"][::std::mem::offset_of!(GoSlice, len) - 8usize];
    ["Offset of field: GoSlice::cap"][::std::mem::offset_of!(GoSlice, cap) - 16usize];
};
unsafe extern "C" {
    pub fn CWmInit(
        path: *mut ::std::os::raw::c_char,
        proxy: *mut ::std::os::raw::c_char,
        sendType: GoInt,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmLogin(connId: GoInt) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmLogout(connId: GoInt) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmCleanup(connId: GoInt) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmGetVersion() -> GoInt;
}
unsafe extern "C" {
    pub fn CWmGetMessages(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        limit: GoInt,
        fromMsgId: *mut ::std::os::raw::c_char,
        owner: GoInt,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmSendMessage(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        text: *mut ::std::os::raw::c_char,
        quotedId: *mut ::std::os::raw::c_char,
        quotedText: *mut ::std::os::raw::c_char,
        quotedSender: *mut ::std::os::raw::c_char,
        filePath: *mut ::std::os::raw::c_char,
        fileType: *mut ::std::os::raw::c_char,
        editMsgId: *mut ::std::os::raw::c_char,
        editMsgSent: GoInt,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmGetContacts(connId: GoInt) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmGetStatus(connId: GoInt, userId: *mut ::std::os::raw::c_char) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmMarkMessageRead(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        senderId: *mut ::std::os::raw::c_char,
        msgId: *mut ::std::os::raw::c_char,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmDeleteMessage(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        senderId: *mut ::std::os::raw::c_char,
        msgId: *mut ::std::os::raw::c_char,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmDeleteChat(connId: GoInt, chatId: *mut ::std::os::raw::c_char) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmSendTyping(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        isTyping: GoInt,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmSendStatus(connId: GoInt, isOnline: GoInt) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmDownloadFile(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        msgId: *mut ::std::os::raw::c_char,
        fileId: *mut ::std::os::raw::c_char,
        action: GoInt,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmSendReaction(
        connId: GoInt,
        chatId: *mut ::std::os::raw::c_char,
        senderId: *mut ::std::os::raw::c_char,
        msgId: *mut ::std::os::raw::c_char,
        emoji: *mut ::std::os::raw::c_char,
    ) -> GoInt;
}
unsafe extern "C" {
    pub fn CWmExtGetState(connId: GoInt) -> GoInt64;
}
